/* нахождение минимума среди 2 чисел*/
{
    // let x, y, min;
    // x = parseInt(prompt("Введите 1 число"));
    // y = parseInt(prompt("Введите 2 число"));
    // z = parseInt(prompt("Введите 3 число"));


    // min = x; 

    // if (y < min ) 
    // {
    // min = y;
    // }
    // if (z < min){
    // min = z;
    // }


    // alert("min = " + min);
}
{
//     let x, y;
//     /* вывести нечетный цифры от 0 до 10*/
//     for (let i = 1; i<10; i+=2)
//     {
//         if (i % 2 != 0 )
//             console.log(i);
        
//     }
}

{
    // // найти кол-во нечетных чисел в последовательности. Последовательность чисео вводится с клавиатуры и заканчивается вводом 0.
    // count = 0;
    // let x;
    // x = parseInt(prompt("Введите любое число. 0 - выход"));
    // while (x != 0 )
    //      {
    //         x = parseInt(prompt("Введите любое число. 0 - выход"));
    //         if (x%2!=0){
    //             count++;
    //         }
            
    //      }
    //      alert("Кол - во нечетных " + count)
}
{
    // // Найти кол-во нечетных цифр в натуральном числе.

    // let count = 0, d, x;
    // x = parseInt(prompt("Введите любое натуральное число. 0 - выход"));
    // while ( x != 0)
    // {
    //     d  = x % 10; 
    //     if(d % 2 != 0)
    //     {
    //         count++;
    //     }
    //     x = math.floor(x/10);

    // }
    // alert("кол-во нечетных цифр " + count);
    
}
