{
    // . Если целое число m делится нацело на целое число n, то вывести на экран частное от деления, в противном случае вывести сообщение "m на n нацело неделится".
    let m, n;
    m = parseInt(prompt("Введите 1 число"));
    n = parseInt(prompt("Введите 2 число"));
    if (m % n == 0 )
    {
        alert("Ваш итог" + m/n);
    }
    else {
        alert ("Число нацело не делится");
    }
}
{
    /*. Дано трехзначное число. Определить:
    а) входит ли в него цифра 6;
    б) входит ли в него цифра n.
    */ 

    
}